; ---------------------------------------------------------------
;					DEPLOY


[IRI_DynamicDeployment X2AbilityTemplate]
LocFriendlyName="动态部署"
LocLongDescription="指定一个位置来部署小队的其他成员。"
LocHelpText="指定一个位置来部署小队的其他成员。"

[IRI_DynamicDeployment_Deploy X2AbilityTemplate]
LocFriendlyName="动态部署"
LocLongDescriptionWhenConcealed = "指定一个位置来部署小队的其他成员。将打破小队隐蔽。"
LocLongDescription="指定一个位置来部署小队的其他成员。"
LocHelpText="指定一个位置来部署小队的其他成员。"
LocFlyOverText="动态部署"

[IRI_DynamicDeployment_Deploy_Spark X2AbilityTemplate]
LocFriendlyName="动态部署"
LocLongDescriptionWhenConcealed = "指定一个位置来部署小队的其他成员。将打破小队隐蔽。"
LocLongDescription="指定一个位置来部署小队的其他成员。"
LocHelpText="指定一个位置来部署小队的其他成员。"
LocFlyOverText="动态部署"

[IRI_DynamicDeployment_Deploy_Uplink X2AbilityTemplate]
LocFriendlyName="动态部署"
LocLongDescriptionWhenConcealed = "使用你的[数字上行链路]指定一个位置来部署小队的其他成员。不会打破小队隐蔽。"
LocLongDescription="使用你的[数字上行链路]指定一个位置来部署小队的其他成员。"
LocHelpText="使用你的[数字上行链路]指定一个位置来部署小队的其他成员。"
LocFlyOverText="动态部署"

; ---------------------------------------------------------------
;					GTS UNLOCK

[IRI_DynamicDeployment_GTS_Unlock X2SoldierAbilityUnlockTemplate]
DisplayName = "动态部署"
Summary = "对全部人员进行动态部署培训，这种技术使我们能在任务开始后部署一部分小队成员。"

; ---------------------------------------------------------------
;					DD UNLOCKS

[IRI_DDUnlock_PrecisionDrop X2AbilityTemplate]
LocFriendlyName="精确降落"
LocLongDescription="该单位能在可部署区域内，为动态部署选择精确的位置。"
LocHelpText="该单位能在可部署区域内，为动态部署选择精确的位置。"

[IRI_DDUnlock_AerialScout X2AbilityTemplate]
LocFriendlyName="空中侦察"
LocLongDescription="动态部署期间，士兵将可看到<Ability:IRI_DD_AerialScout_PerUnitRadius_Tiles/>额外方格的地形和附近单位；区域随着更多单位而扩大。无法在地下使用。"
LocHelpText="动态部署期间，士兵将可看到<Ability:IRI_DD_AerialScout_PerUnitRadius_Tiles/>额外方格的地形和附近单位；区域随着更多单位而扩大。无法在地下使用。"

[IRI_DDUnlock_TakeAndHold X2AbilityTemplate]
LocFriendlyName="攻占并坚守"
LocLongDescription="动态部署后，该单位获得+<Ability:IRI_DD_TakeAndHold_AimBonus/>命中和+<Ability:IRI_DD_TakeAndHold_DefenseBonus/>防御。持续<Ability:IRI_DD_TakeAndHold_DurationTurns/>回合，或直到他们进行[冲刺]。"
LocHelpText="动态部署后，该单位获得+<Ability:IRI_DD_TakeAndHold_AimBonus/>命中和+<Ability:IRI_DD_TakeAndHold_DefenseBonus/>防御。持续<Ability:IRI_DD_TakeAndHold_DurationTurns/>回合，或直到他们进行[冲刺]。"
LocFlyOverText="攻占并坚守"

[IRI_DDUnlock_TakeAndHold_Passive X2AbilityTemplate]
LocFriendlyName="攻占并坚守"
LocLongDescription="动态部署后，该单位获得+<Ability:IRI_DD_TakeAndHold_AimBonus/>命中和+<Ability:IRI_DD_TakeAndHold_DefenseBonus/>防御。持续<Ability:IRI_DD_TakeAndHold_DurationTurns/>回合，或直到他们进行[冲刺]。"
LocHelpText="动态部署后，该单位获得+<Ability:IRI_DD_TakeAndHold_AimBonus/>命中和+<Ability:IRI_DD_TakeAndHold_DefenseBonus/>防御。持续<Ability:IRI_DD_TakeAndHold_DurationTurns/>回合，或直到他们进行[冲刺]。"

[IRI_DDUnlock_HitGroundRunning X2AbilityTemplate]
LocFriendlyName="触地快跑"
LocLongDescription="动态部署后，该单位获得+<Ability:IRI_DD_HitGroundRunning_MobilityBonus/>移动力，直到回合结束。"
LocHelpText="动态部署后，该单位获得+<Ability:IRI_DD_HitGroundRunning_MobilityBonus/>移动力，直到回合结束。"
LocFlyOverText="触地快跑"

[IRI_DDUnlock_HitGroundRunning_Passive X2AbilityTemplate]
LocFriendlyName="触地快跑"
LocLongDescription="动态部署后，该单位获得+<Ability:IRI_DD_HitGroundRunning_MobilityBonus/>移动力，直到回合结束。"
LocHelpText="动态部署后，该单位获得+<Ability:IRI_DD_HitGroundRunning_MobilityBonus/>移动力，直到回合结束。"


[IRI_DDUnlock_DigitalUplink X2AbilityTemplate]
LocFriendlyName="数字上行链路"
LocLongDescription="该单位能在不打破小队隐蔽的情况下，从更远的距离呼叫动态部署。"
LocHelpText="该单位能在不打破小队隐蔽的情况下，从更远的距离呼叫动态部署"
LocFlyOverText="数字上行链路"

; ---------------------------------------------------------------
;					SITREPS

[IRI_DD_NoDeploymentSitRep X2SitRepTemplate]
FriendlyName = "禁止部署区域"
Description = "在此任务期间，动态部署将不可用。"
